#Detect failed logins:
index=dmz_traffic sourcetype=access_combined status=401
| stats count by src_ip, user

#Monitor HTTP status codes:
index=dmz_traffic sourcetype=access_combined
| timechart count by status

#Detect suspicious traffic spikes
index=dmz_traffic
| bin _time span=5m
| stats count by _time, src_ip
| where count > 100
